tap "hashicorp/tap"

brew "hashicorp/tap/terraform"
brew "asdf"
brew "autojump"
brew "ffmpeg"
brew "fzf"
brew "mas"
brew "starship"
brew "thefuck"
brew "git"
brew "git-lfs"
brew "jq"
brew "ack"
brew "awscli"
brew "ripgrep"
brew "shellcheck"
brew "vim"
brew "wget"

cask "1password"
cask "1password-cli"
cask "adguard"
cask "android-studio"
cask "ghostty"
cask "rectangle"
cask "slack"
cask "docker"
cask "visual-studio-code"
cask "tailscale"
cask "handbrake"
cask "obsidian"
cask "shottr"
cask "spotify"
cask "tableplus"
cask "vlc"
cask "maccy"

mas "1Password for Safari", id: 1569813296
mas "Xcode", id: 497799835

vscode "vscodevim.vim"
vscode "sleistner.vscode-fileutils"
