tap "hashicorp/tap"

# Terminal Tools
brew "starship"

# Utils
brew "coreutils"
brew "ripgrep"
brew "autojump"
brew "thefuck"
brew "fzf" # Used with ctrl+r plugin
brew "ffmpeg"
brew "jq"
brew "ack"
brew "wget"
brew "shellcheck"

# Dependency management
brew "mas" # Mac App Store CLI

# Dev Tools
brew "hashicorp/tap/terraform"
brew "git"
brew "git-lfs"
brew "awscli"
brew "vim"
brew "mise"
brew "uv" # Python CLI tool for managing environments and more
brew "flyway" # Database migration tool. Used in Brick
brew "kdoctor" # helps to set up the environment for Kotlin Multiplatform Mobile app development.
brew "xcode-kotlin" # Kotlin Multiplatform Mobile development plugin to allow debugging kotlin on xcode



cask "1password"
cask "1password-cli"
cask "adguard"
cask "android-studio"
cask "android-commandlinetools"
cask "ghostty"
cask "rectangle"
cask "slack"
cask "docker"
cask "visual-studio-code"
cask "tailscale"
cask "handbrake"
cask "obsidian"
cask "shottr"
cask "spotify"
cask "tableplus"
cask "vlc"
cask "maccy"
cask "chromium"
# cask "logitech-options" # Used for managing logitech tools, i.e. your mice, commented out just in case you dont keep logitech devices
# cask "powershell"

mas "1Password for Safari", id: 1569813296
mas "Xcode", id: 497799835
mas "Elmedia Video Player", id: 1044549675

vscode "vscodevim.vim"
vscode "sleistner.vscode-fileutils"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mathiasfrohlich.kotlin"
vscode "ms-vscode.powershell"
vscode "rooveterinaryinc.roo-cline"
vscode "yzhang.markdown-all-in-one"
