# Homebrew Bundle File
# Generated by `brew bundle dump` and then manually organized.
#
# This file can be used with `brew bundle install` to install all listed software.
# For more information, see: https://docs.brew.sh/Brew-Bundle-and-Brewfile#brew-bundle

# Taps
# Add external repositories for formulae and casks not in the main Homebrew repos.
tap "hashicorp/tap"         # For HashiCorp tools like Terraform

# Brew Packages (Command Line Interface tools)
# --------------------------------------------

# Terminal Enhancements & Shell Utilities
brew "starship"             # Minimal for shell
brew "autojump"             # A cd command that learns - easily navigate directories from the command line
brew "fzf"                  # Command-line fuzzy finder (often used with ctrl+r for history search)
brew "thefuck"              # corrects your previous console command
brew "shellcheck"           # Static analysis tool for shell scripts

# File & Text Utilities
brew "coreutils"            # GNU File, Shell, and Text utilities
brew "ripgrep"              # like grep but faster
brew "jq"                   # command-line JSON processor
brew "fd"                  # Simple, fast and user-friendly alternative to 'find'
brew "ack"                  # Grep-like tool, optimized for programmers
brew "wget"                 # Non-interactive network downloader

# Development Tools
brew "git"                  # version control
brew "git-lfs"              # Git extension for versioning large files
brew "awscli"               # Official AWS CLI
brew "vim"                  # text editor
brew "mise"                 # Polyglot version manager (replaces asdf, nvm, rbenv, etc.)
brew "uv"                   # Fast Python package installer and resolver
brew "hashicorp/tap/terraform" # Infrastructure as Code software tool
brew "flyway"               # Database migration tool
brew "kdoctor"              # Helps set up the environment for Kotlin Multiplatform Mobile app development
brew "xcode-kotlin"         # Kotlin Multiplatform Mobile plugin for Xcode debugging

# System Utilities
brew "mas"                  # Mac App Store command line interface

# Media Utilities
brew "ffmpeg"               # Complete, cross-platform solution to record, convert and stream audio and video

# Cask Packages (Applications with Graphical User Interfaces)
# ---------------------------------------------------------

# Productivity & Utilities
cask "1password"            # Password manager
cask "1password-cli"        # Command-line interface for 1Password
cask "adguard"              # Ad blocker
cask "rectangle"            # Move and resize windows in macOS using keyboard shortcuts
cask "shottr"               # Screenshot tool with annotation features
cask "obsidian"             # Knowledge base and note-taking app
cask "maccy"                # Clipboard manager
cask "tailscale"            # Mesh VPN for secure connections between your devices
cask "chatbox"             # AI chat client for macOS
cask "notunes"              # Blocks iTunes and Music app from launching automatically
# cask "logitech-options"   # For managing Logitech devices (mice, keyboards). Uncomment if you use Logitech hardware.

# Development
cask "iterm2"               # terminal emulator
cask "docker"               # Platform for developing, shipping, and running applications in containers
brew "docker-compose" # Tool for defining and running multi-container Docker applications. Set in the "casks" section so it is installed after docker
cask "visual-studio-code"   # Source code editor
cask "tableplus"            # UI for relational databases
cask "android-studio"       # IDE for Android app development
# cask "android-commandlinetools" # Command-line tools for Android SDK. It's best to install this manually for PATH reasons.
# cask "powershell"         # Cross-platform automation and configuration tool/framework

# Communication
cask "slack"                # Team communication and collaboration platform

# Media
cask "handbrake"            # Open-source video transcoder
cask "spotify"              # Music streaming service
cask "vlc"                  # Free and open-source cross-platform multimedia player
cask "chromium"             # Open-source web browser project by Google

# Mac App Store Packages
# ----------------------
# Installed using 'mas' (Mac App Store CLI). Requires 'brew install mas'.
mas "1Password for Safari", id: 1569813296 # Safari extension for 1Password
mas "Xcode", id: 497799835                # Integrated development environment for macOS, iOS, watchOS, and tvOS
mas "Elmedia Video Player", id: 1044549675 # Versatile video player

# Visual Studio Code Extensions
# -----------------------------
# Installed via `code --install-extension <extension-id>`
# These are managed by VS Code's settings sync, but can be listed here for documentation.
vscode "vscodevim.vim"                   # Vim emulation for Visual Studio Code
vscode "sleistner.vscode-fileutils"      # File utilities (create, duplicate, move, rename, delete)
vscode "bierner.markdown-mermaid"        # Adds Mermaid diagram and flowchart support to VS Code's Markdown preview
vscode "catppuccin.catppuccin-vsc"       # Soothing pastel theme for VS Code
vscode "catppuccin.catppuccin-vsc-icons" # Catppuccin icons for VS Code
vscode "github.copilot"                  # AI pair programmer
vscode "github.copilot-chat"             # Chat interface for GitHub Copilot
vscode "mathiasfrohlich.kotlin"          # Kotlin language support
vscode "ms-vscode.powershell"            # PowerShell language support
vscode "rooveterinaryinc.roo-cline"      # Roo Cline extension
vscode "yzhang.markdown-all-in-one"      # All-in-one Markdown support (keyboard shortcuts, table of contents, auto preview)
